---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotCreateOpeningRectangularArcWall
source: html/3fc5e520-824e-eab5-5d7b-d9b07410a9af.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotCreateOpeningRectangularArcWall Property

Creation of a Rectangular Arc Wall Opening failed.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCreateOpeningRectangularArcWall { get; }
```